Revit 2027 API
SweepProfile Properties
The SweepProfile type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
SweepProfile Class
Autodesk.Revit.DB Namespace